In [1]:
import pandas as pd

In [2]:

data_0223 = pd.read_csv("lics_histo(2).csv", delimiter = ";")

In [3]:
data_4903 = pd.read_csv("lics_1949_2003.csv", delimiter = ";", encoding="latin-1")

In [4]:
data_0223.info()

<class 'pandas.DataFrame'>
RangeIndex: 3067 entries, 0 to 3066
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   code_fede_2024  3067 non-null   int64
 1   code_fede_ref   3067 non-null   str
 2   Fédération      3067 non-null   str
 3   annee           3067 non-null   str
 4   evol_20ans      2346 non-null   float64
 5   evol_10ans      2484 non-null   float64
 6   evol_5ans       2584 non-null   float64
 7   Lics            2677 non-null   float64
 8   Lics_100_2002   2419 non-null   float64
 9   Lics_100_2016   2516 non-null   float64
 10  fede_gp         3067 non-null   str
dtypes: float64(6), int64(1), str(4)
memory usage: 263.7 KB

In [5]:
data_0223.head()

,code_fede_2024,code_fede_ref,Fédération,annee,evol_20ans,evol_10ans,evol_5ans,Lics,Lics_100_2002,Lics_100_2016,fede_gp
0,101,101,Fédération Française d'Athlétisme,2005-01-01,0.926755,0.182713,-0.008815,167007.0,100.693368,55.304726,1. Olympique
1,101,101,Fédération Française d'Athlétisme,2009-01-01,0.926755,0.182713,-0.008815,193454.0,116.639032,64.062707,1. Olympique
2,101,101,Fédération Française d'Athlétisme,2011-01-01,0.926755,0.182713,-0.008815,219344.0,132.248865,72.636236,1. Olympique
3,101,101,Fédération Française d'Athlétisme,2013-01-01,0.926755,0.182713,-0.008815,256459.0,154.626576,84.926948,1. Olympique
4,101,101,Fédération Française d'Athlétisme,2016-01-01,0.926755,0.182713,-0.008815,301976.0,182.070097,100.000000,1. Olympique

In [6]:
data_0223["Lics"].replace({float('NaN'): '0'})
data_0223["fede_gp"] = data_0223["fede_gp"].replace({
    "1. Olympique": "olympique",
    '2. Délégataire non-olympique' : "non-olympique",
    '4. Affinitaire' : "affinitaire",
    '5. Para-sport' : 'para-sport',
    "6. Scolaire": "scolaire",
    "0. Toutes fédés": "Toutes fedes"
})

In [7]:
data_0223.groupby(
    by=["annee", "fede_gp"],
)["Lics"].agg(['sum']
)

                                 sum
annee      fede_gp
2002-01-01 affinitaire     2015710.0
           non-olympique   1844668.0
           olympique       7622837.0
           para-sport        41728.0
           scolaire        2560501.0
...                              ...
2024-01-01 affinitaire     3510732.0
           non-olympique   3921797.0
           olympique      20131252.0
           para-sport       162474.0
           scolaire        6549758.0

[124 rows x 1 columns]

In [8]:
pivot = data_0223.pivot_table(
    index="annee",
    columns="fede_gp",
    values="Lics",
    aggfunc='sum'
)
pivot = pivot.reset_index()
print(pivot)

fede_gp       annee  Toutes fedes  affinitaire  non-olympique   olympique  \
0        2002-01-01           NaN    2015710.0      1844668.0   7622837.0
1        2003-01-01           NaN    2058876.0      1832784.0   7734240.0
2        2004-01-01           NaN    2031985.0      1839906.0   7848764.0
3        2005-01-01           NaN    2215237.0      1839718.0   8024416.0
4        2006-01-01           NaN    2190863.0      1843245.0   8087010.0
5        2007-01-01           NaN    2166763.0      1841087.0   8323199.0
6        2008-01-01           NaN    2175559.0      1847156.0   8461177.0
7        2009-01-01           NaN    2177078.0      1859866.0   8630856.0
8        2010-01-01           NaN    2186168.0      1865247.0   8644926.0
9        2011-01-01           NaN    2175715.0      1875636.0   8607498.0
10       2012-01-01           NaN    2133400.0      1901884.0   8736938.0
11       2013-01-01           NaN    2105576.0      1905721.0   8912139.0
12       2014-01-01           NaN    2089912.0      1883807.0   8937887.0
13       2015-01-01           NaN    2060210.0      1894244.0   9008460.0
14       2016-01-01    16216633.0    4063160.0      3845928.0  18124440.0
15       2017-01-01    16367987.0    4094840.0      3884638.0  18215314.0
16       2018-01-01    16254366.0    4025172.0      3882966.0  18001326.0
17       2019-01-01    16257151.0    3949178.0      3842542.0  18182622.0
18       2020-01-01    15712401.0    3860964.0      3609796.0  17705526.0
19       2021-01-01    12838447.0    2459656.0      3021926.0  15646920.0
20       2022-01-01    15265193.0    3071457.0      3559972.0  18048388.0
21       2023-01-01    16507132.0    3322476.0      3817602.0  19302646.0
22       2024-01-01    17114949.0    3510732.0      3921797.0  20131252.0

fede_gp  para-sport   scolaire
0           41728.0  2560501.0
1           42883.0  2535739.0
2           45137.0  2523192.0
3           45212.0  2639330.0
4           47649.0  2633186.0
5           49686.0  2720623.0
6           55159.0  2806656.0
7           58263.0  2820368.0
8           59949.0  2835824.0
9           60678.0  2846089.0
10          61642.0  2803133.0
11          67670.0  2910765.0
12          70390.0  2897297.0
13          74353.0  3046437.0
14         152726.0  6249858.0
15         158930.0  6385068.0
16         155526.0  6446558.0
17         158198.0  6384576.0
18         152022.0  6099308.0
19          96544.0  4454662.0
20         136860.0  5740346.0
21         155198.0  6444266.0
22         162474.0  6549758.0

In [9]:

data_4903 = data_4903['Année;Clubs;Fédérations Olympiques;Fédérations Non-Olympiques;Fédérations Multisports et Affinitaires;Fédérations Scolaires et Universitaires;Total'].str.split(';', expand=True)

In [10]:
data_4903.columns = ['annee', 'club', 'olympique', 'non-olympique', 'affinitaire', 'scolaire', 'total']
data_4903.head()
data_4903['club'] = data_4903["club"].apply(int)
data_4903['olympique'] = data_4903["olympique"].apply(int)
data_4903['non-olympique'] = data_4903["non-olympique"].apply(int)
data_4903['affinitaire'] = data_4903["affinitaire"].apply(int)
data_4903['scolaire'] = data_4903["scolaire"].apply(int)
data_4903['total'] = data_4903["total"].apply(int)

data_4903.info()

<class 'pandas.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   annee          55 non-null     str
 1   club           55 non-null     int64
 2   olympique      55 non-null     int64
 3   non-olympique  55 non-null     int64
 4   affinitaire    55 non-null     int64
 5   scolaire       55 non-null     int64
 6   total          55 non-null     int64
dtypes: int64(6), str(1)
memory usage: 3.1 KB

In [11]:
for col in data_4903.columns:
    if data_4903[col].dtype == "int64":
        data_4903[col] = data_4903[col] * 1000

data_4903.head()

  annee   club  olympique  non-olympique  affinitaire  scolaire    total
0  1949  58000     949000         322000       478000    187000  1935000
1  1950  67000    1001000         312000       510000    331000  2154000
2  1951  72000    1220000         324000       407000    338000  2289000
3  1952  71000    1226000         347000       406000    382000  2360000
4  1953  65000    1057000         372000       425000    399000  2252000

In [12]:
pivot.head()

fede_gp,annee,Toutes fedes,affinitaire,non-olympique,olympique,para-sport,scolaire
0,2002-01-01,NaN,2015710.0,1844668.0,7622837.0,41728.0,2560501.0
1,2003-01-01,NaN,2058876.0,1832784.0,7734240.0,42883.0,2535739.0
2,2004-01-01,NaN,2031985.0,1839906.0,7848764.0,45137.0,2523192.0
3,2005-01-01,NaN,2215237.0,1839718.0,8024416.0,45212.0,2639330.0
4,2006-01-01,NaN,2190863.0,1843245.0,8087010.0,47649.0,2633186.0

In [13]:

data_0223v2=pivot.drop(columns=["Toutes fedes", "para-sport"])
data_0223v2=data_0223v2[[
    "annee", 
    "olympique", 
    "non-olympique",
    "affinitaire", 
    "scolaire"
]]

data_0223v2

fede_gp       annee   olympique  non-olympique  affinitaire   scolaire
0        2002-01-01   7622837.0      1844668.0    2015710.0  2560501.0
1        2003-01-01   7734240.0      1832784.0    2058876.0  2535739.0
2        2004-01-01   7848764.0      1839906.0    2031985.0  2523192.0
3        2005-01-01   8024416.0      1839718.0    2215237.0  2639330.0
4        2006-01-01   8087010.0      1843245.0    2190863.0  2633186.0
5        2007-01-01   8323199.0      1841087.0    2166763.0  2720623.0
6        2008-01-01   8461177.0      1847156.0    2175559.0  2806656.0
7        2009-01-01   8630856.0      1859866.0    2177078.0  2820368.0
8        2010-01-01   8644926.0      1865247.0    2186168.0  2835824.0
9        2011-01-01   8607498.0      1875636.0    2175715.0  2846089.0
10       2012-01-01   8736938.0      1901884.0    2133400.0  2803133.0
11       2013-01-01   8912139.0      1905721.0    2105576.0  2910765.0
12       2014-01-01   8937887.0      1883807.0    2089912.0  2897297.0
13       2015-01-01   9008460.0      1894244.0    2060210.0  3046437.0
14       2016-01-01  18124440.0      3845928.0    4063160.0  6249858.0
15       2017-01-01  18215314.0      3884638.0    4094840.0  6385068.0
16       2018-01-01  18001326.0      3882966.0    4025172.0  6446558.0
17       2019-01-01  18182622.0      3842542.0    3949178.0  6384576.0
18       2020-01-01  17705526.0      3609796.0    3860964.0  6099308.0
19       2021-01-01  15646920.0      3021926.0    2459656.0  4454662.0
20       2022-01-01  18048388.0      3559972.0    3071457.0  5740346.0
21       2023-01-01  19302646.0      3817602.0    3322476.0  6444266.0
22       2024-01-01  20131252.0      3921797.0    3510732.0  6549758.0

In [14]:
data_0223v2['annee'] = pd.to_datetime(data_0223v2['annee']).dt.year
data_0223v2['annee'] = data_0223v2['annee'].apply(str)
data_0223v2.head()

fede_gp annee  olympique  non-olympique  affinitaire   scolaire
0        2002  7622837.0      1844668.0    2015710.0  2560501.0
1        2003  7734240.0      1832784.0    2058876.0  2535739.0
2        2004  7848764.0      1839906.0    2031985.0  2523192.0
3        2005  8024416.0      1839718.0    2215237.0  2639330.0
4        2006  8087010.0      1843245.0    2190863.0  2633186.0

In [15]:
total=data_0223.groupby(
    by=["annee"],
)["Lics"].agg(['sum'])

total.reset_index(inplace=True)
total['annee'] = pd.to_datetime(total['annee']).dt.year
total['annee'] = total['annee'].apply(str)

print(total)

   annee         sum
0   2002  14085444.0
1   2003  14204522.0
2   2004  14288984.0
3   2005  14763913.0
4   2006  14801953.0
5   2007  15101358.0
6   2008  15345707.0
7   2009  15546431.0
8   2010  15592114.0
9   2011  15565616.0
10  2012  15636997.0
11  2013  15901871.0
12  2014  15879293.0
13  2015  16083704.0
14  2016  48652745.0
15  2017  49106777.0
16  2018  48765914.0
17  2019  48774267.0
18  2020  47140017.0
19  2021  38518155.0
20  2022  45822216.0
21  2023  49549320.0
22  2024  51390962.0

In [16]:
data_4903=data_4903.drop(columns="club")
data_4903['annee'] = data_4903['annee'].apply(str)

In [17]:
data_4903=data_4903.drop(data_4903[data_4903['annee'].isin(["2002", "2003"])].index)

In [18]:
print(data_4903[data_4903["annee"] == 2002])

Empty DataFrame
Columns: [annee, olympique, non-olympique, affinitaire, scolaire, total]
Index: []

In [19]:
data_4903.head()

  annee  olympique  non-olympique  affinitaire  scolaire    total
0  1949     949000         322000       478000    187000  1935000
1  1950    1001000         312000       510000    331000  2154000
2  1951    1220000         324000       407000    338000  2289000
3  1952    1226000         347000       406000    382000  2360000
4  1953    1057000         372000       425000    399000  2252000

In [20]:
data_0223v2 = data_0223v2.merge(total, on="annee", how="left")
print(data_0223v2)

   annee   olympique  non-olympique  affinitaire   scolaire         sum
0   2002   7622837.0      1844668.0    2015710.0  2560501.0  14085444.0
1   2003   7734240.0      1832784.0    2058876.0  2535739.0  14204522.0
2   2004   7848764.0      1839906.0    2031985.0  2523192.0  14288984.0
3   2005   8024416.0      1839718.0    2215237.0  2639330.0  14763913.0
4   2006   8087010.0      1843245.0    2190863.0  2633186.0  14801953.0
5   2007   8323199.0      1841087.0    2166763.0  2720623.0  15101358.0
6   2008   8461177.0      1847156.0    2175559.0  2806656.0  15345707.0
7   2009   8630856.0      1859866.0    2177078.0  2820368.0  15546431.0
8   2010   8644926.0      1865247.0    2186168.0  2835824.0  15592114.0
9   2011   8607498.0      1875636.0    2175715.0  2846089.0  15565616.0
10  2012   8736938.0      1901884.0    2133400.0  2803133.0  15636997.0
11  2013   8912139.0      1905721.0    2105576.0  2910765.0  15901871.0
12  2014   8937887.0      1883807.0    2089912.0  2897297.0  15879293.0
13  2015   9008460.0      1894244.0    2060210.0  3046437.0  16083704.0
14  2016  18124440.0      3845928.0    4063160.0  6249858.0  48652745.0
15  2017  18215314.0      3884638.0    4094840.0  6385068.0  49106777.0
16  2018  18001326.0      3882966.0    4025172.0  6446558.0  48765914.0
17  2019  18182622.0      3842542.0    3949178.0  6384576.0  48774267.0
18  2020  17705526.0      3609796.0    3860964.0  6099308.0  47140017.0
19  2021  15646920.0      3021926.0    2459656.0  4454662.0  38518155.0
20  2022  18048388.0      3559972.0    3071457.0  5740346.0  45822216.0
21  2023  19302646.0      3817602.0    3322476.0  6444266.0  49549320.0
22  2024  20131252.0      3921797.0    3510732.0  6549758.0  51390962.0

In [21]:
data49_23 = pd.concat([data_4903, data_0223v2], ignore_index=True)

data49_23.info()

<class 'pandas.DataFrame'>
RangeIndex: 76 entries, 0 to 75
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   annee          76 non-null     str
 1   olympique      76 non-null     float64
 2   non-olympique  76 non-null     float64
 3   affinitaire    76 non-null     float64
 4   scolaire       76 non-null     float64
 5   total          53 non-null     float64
 6   sum            23 non-null     float64
dtypes: float64(6), str(1)
memory usage: 4.3 KB

In [22]:
data49_23.to_csv("lic_clean_49_24.csv")